bdionello/ECE499/STM32L0_Project1/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2024 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdio.h>
#include <stdlib.h>
#include <math.h>
#include <string.h>
#include "stm32l0538_discovery_epd.h"
#include "stm32l0538_discovery.h"
#include "images.c"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
typedef enum {
	VBAT_LOW,
	VBAT_OK,
	VBAT_HIGH,
	VSOL_LOW,
	VSOL_OK,
	IBAT_LOW,
	NOTHING,
	MAX_EVENT
} Event;
typedef enum {
	START, IDLE, CHARGE_M, CHARGE_T, CHARGE_F, MAX_STATE
} State;
typedef void (*Action)(void);
typedef struct {
	Action to_do; // function pointer to current-state action
	State next_state; // next-state enumerator
} Table_Cell;
/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define pulse_max 630 // 640 is counter period
#define pulse_min 10
#define ADC_MAX 4095
#define VSOL_MAX 20.7
#define VBAT_MAX 15.0
#define VDDA 3.3
#define TEST_SOL_PERIOD 5

#define VSOL_OK_VOLTAGE 155
#define VBAT_OK_VOLTAGE 3228//12.5 with -0.795600322 Offset
#define VBAT_LOW_VOLTAGE 3021//11.75 with -0.795600322 Offset
#define VBAT_HIGH_VOLTAGE 3835//14.7 with -0.795600322 Offset
#define VOLTAGE_TOPPING 3697
#define VOLTAGE_FLOAT 3504
#define IBAT_LOW_CURRENT 81
#define ISOL_OK_CURRENT 10

#define VSOL_SCALE 6.446414182
#define VBAT_SCALE 3.86763813
#define ISOL_SCALE 2.014504432
#define IBAT_SCALE 4.029008864
#define ILOAD_SCALE 8.058017728

#define DVDB 100
#define DIDB 5
#define IVDB 0.03

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc;
DMA_HandleTypeDef hdma_adc;

SPI_HandleTypeDef hspi1;

TIM_HandleTypeDef htim6;
TIM_HandleTypeDef htim21;

UART_HandleTypeDef huart1;
DMA_HandleTypeDef hdma_usart1_tx;

/* USER CODE BEGIN PV */
char aTxBuffer[60];
uint8_t aHeaderBuffer[] = "Event,State,Duty_Cycle,Voltage_Solar,Current_Solar,Voltage_Batter,Current_Battery\n";
uint8_t adc_conv_complt_flag;
uint32_t aResultDMA[5];
uint16_t TXBUFFERSIZE = (sizeof(aTxBuffer) / sizeof(*aTxBuffer)) - 1;
uint16_t v_sol, v_bat, i_sol, i_bat, i_load;
uint8_t loadState = 0;
uint8_t refTim = 0;

//remove these
int dV = 0;
int dI = 0;
uint16_t dIdV = 0;
uint16_t IV = 0;
uint16_t oldVolt = 0;
uint16_t oldCurrent = 0;
uint16_t voltage = 0;
uint16_t current = 0;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_SPI1_Init(void);
static void MX_ADC_Init(void);
static void MX_TIM21_Init(void);
static void MX_TIM6_Init(void);
static void MX_USART1_UART_Init(void);
/* USER CODE BEGIN PFP */
static int PWM_DC_Step(int dir, int size);
static int inc_Con(void);
static void do_nothing(void);
static void pwm_on(void);
static void pwm_off(void);
static void charge_t(void);
static void charge_f(void);
static void update_inputs(void);
static Event update_events(State current_s);
static void load_on(void);
static void load_off(void);
static void refreshDisplay(void);
static void logger(State current_state, Event current_event);
static void test_solar(void);

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
Table_Cell state_table[MAX_STATE][MAX_EVENT] = {
/*[0] VBAT_LOW            [1] VBAT_OK           [2] VBAT_HIGH           [3] VSOL_LOW            [4] VSOL_OK            5] IBAT_LOW             [6] NOTHING <--EVENTS |                  STATES */
{ { do_nothing, START }, { load_on, IDLE }, { do_nothing, START }, { do_nothing,
		START }, { pwm_on, CHARGE_M }, { do_nothing, START }, { do_nothing,
		START } },             // START
		{ { load_off, START }, { do_nothing, IDLE }, { do_nothing, IDLE }, {
				do_nothing, IDLE }, { pwm_on, CHARGE_M }, { do_nothing, IDLE },
				{ do_nothing, IDLE } },                   // IDLE
		{ { load_off, CHARGE_M }, { load_on, CHARGE_M },
				{ do_nothing, CHARGE_T }, { pwm_off, IDLE }, { do_nothing,
						CHARGE_M }, { do_nothing, CHARGE_M }, { do_nothing,
						CHARGE_M } }, // CHARGE_M
		{ { load_off, CHARGE_M }, { do_nothing, CHARGE_T }, { do_nothing,
				CHARGE_T }, { pwm_off, IDLE }, { do_nothing, CHARGE_T }, {
				do_nothing, CHARGE_F }, { do_nothing, CHARGE_T } }, // CHARGE_T
		{ { load_off, CHARGE_M }, { do_nothing, CHARGE_F }, { do_nothing,
				CHARGE_F }, { pwm_off, IDLE }, { do_nothing, CHARGE_F }, {
				do_nothing, CHARGE_F }, { do_nothing, CHARGE_F } } // CHARGE_F
};
const char *event_names[] = { "VBAT_LOW", "VBAT_OK", "VBAT_HIGH", "VSOL_LOW",
		"VSOL_OK", "IBAT_LOW", "NOTHING" };
const char *state_names[] = { "START", "IDLE", "CHARGE_M", "CHARGE_T",
		"CHARGE_F", "MAX_STATE" };
/*
 /* USER CODE END 0 */

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void) {

	/* USER CODE BEGIN 1 */
	/* State machine variables*/
    Table_Cell state_cell;
    Event current_event, last_event;
    State current_state, last_state;
    current_state = START ; // initial state

