bdionello/ECE499/STM32L0_Project1/Core/Src/main.c
	while (exit == 0) {
		switch (state) {
		case 0:
			if (dV == 0) {
				state = 1;
				break;
			} else {
				state = 2;
				break;
			}
		case 1:
			if (dI == 0) {
				state = 0;
				status = 0;
				exit = 1;
				break;
			} else {
				state = 3;
				break;
			}
		case 2:
			if (dIdV == IV) {
				state = 0;
				status = 0;
				exit = 1;
				break;
			} else {
				state = 4;
				break;
			}
		case 3:
			if (dI > 0) {
				status = PWM_DC_Step(1, 20);
				state = 0;
				exit = 1;
				break;
			} else {
				status = PWM_DC_Step(0, 20);
				state = 0;
				exit = 1;
				break;
			}
		case 4:
			if (dIdV > (IV)) {
				status = PWM_DC_Step(0, 20);
				state = 0;
				exit = 1;
				break;
			} else {
				status = PWM_DC_Step(1, 20);
				state = 0;
				exit = 1;
				break;
			}
		case 5:
			status = PWM_DC_Step(1, 7);
			state = 0;
			exit = 1;
			break;
		case 6:
			status = PWM_DC_Step(0,7);
			state = 0;
			exit = 1;
		default:
			status = 1;
			exit = 1;
			break;
		}
	}
	oldVolt = v_sol;
	oldCurrent = i_sol;
	return (status);
}

/* Refreshes screen
 * @Uses a temp char array to hold value of current and voltage scaled to milli.
 * @Displays a sun or moon depending on if solar voltage is higher or lower than battery voltage
 * @Refreshes that bad boy  */
void refreshDisplay(void) {
	//v_sol = (rand() % (4095 - 0 + 1)) + 0;
	int tempVal = v_sol * VSOL_SCALE;
	char tempStr[6]; //Should be good up to 99999 mA/mV
	sprintf(tempStr, "%i", tempVal);
	BSP_EPD_Clear(EPD_COLOR_WHITE);
	BSP_EPD_SetFont(&Font12);
	BSP_EPD_DisplayStringAt(1, 0, "Panel Voltage is: ", LEFT_MODE);
	BSP_EPD_DisplayStringAt(130, 0, tempStr, LEFT_MODE);
	BSP_EPD_DisplayStringAt(170, 0, "mV", LEFT_MODE);
	//test = 1337; //test variable, replace with I_sol and scale to mA
	//i_sol = (rand() % (4095 - 0 + 1)) + 0;
	tempVal = i_sol * ISOL_SCALE;
	sprintf(tempStr, "%i", tempVal);
	BSP_EPD_DisplayStringAt(1, 3, "Panel Current is: ", LEFT_MODE);
	BSP_EPD_DisplayStringAt(130, 3, tempStr, LEFT_MODE);
	BSP_EPD_DisplayStringAt(170, 3, "mA", LEFT_MODE);
	//test = 12312; //test variable, replace with v_bat and scale to mV
	//v_bat = (rand() % (4095 - 0 + 1)) + 0;
	tempVal = v_bat * VBAT_SCALE;
	sprintf(tempStr, "%i", tempVal);
	BSP_EPD_DisplayStringAt(1, 6, "Battery Voltage is: ", LEFT_MODE);
	BSP_EPD_DisplayStringAt(140, 6, tempStr, LEFT_MODE);
	BSP_EPD_DisplayStringAt(180, 6, "mV", LEFT_MODE);
	//test = 1613; //test variable, replace with I_bat and scale to mA
	//i_bat = (rand() % (4095 - 0 + 1)) + 0;
	tempVal = i_bat * IBAT_SCALE;
	sprintf(tempStr, "%i", tempVal);
	BSP_EPD_DisplayStringAt(1, 9, "Battery Current is: ", LEFT_MODE);
	BSP_EPD_DisplayStringAt(140, 9, tempStr, LEFT_MODE);
	BSP_EPD_DisplayStringAt(180, 9, "mA", LEFT_MODE);
	if (v_sol >= VSOL_OK_VOLTAGE) {
		BSP_EPD_DisplayStringAt(1, 12, "Solar Present", LEFT_MODE);
		BSP_EPD_DrawImage(200, 0, 30, 45, Sun);
	} else {
		BSP_EPD_DisplayStringAt(1, 12, "Solar Hidden", LEFT_MODE);
		BSP_EPD_DrawImage(200, 0, 30, 45, Moon);
	}
	if (v_bat < VBAT_LOW_VOLTAGE) {
		BSP_EPD_DisplayStringAt(95, 12, "|Batt Low", LEFT_MODE);
		BSP_EPD_DrawImage(200, 6, 30, 45, batLow);
	} else if (v_bat >= VBAT_OK_VOLTAGE && v_bat <= VBAT_HIGH_VOLTAGE) {
		BSP_EPD_DisplayStringAt(95, 12, "|Batt Charge", LEFT_MODE);
		BSP_EPD_DrawImage(200, 6, 30, 45, batCharge);
	} else {
		BSP_EPD_DisplayStringAt(95, 12, "|Batt Full", LEFT_MODE);
		BSP_EPD_DrawImage(200, 6, 30, 45, batFull);
	}
	if (loadState == 0) {
		BSP_EPD_DisplayStringAt(185, 12, "|Load Off", LEFT_MODE);
	} else {
		BSP_EPD_DisplayStringAt(185, 12, "|Load On", LEFT_MODE);
	}
	BSP_EPD_RefreshDisplay();
}

/*    [0] VBAT_LOW    [1] VBAT_OK   [2] VBAT_HIGH  [3] VSOL_LOW     [4] VSOL_OK    [5] IBAT_LOW     <--EVENTS | STATES */
static Event update_events(State current_s) { // START, IDLE , CHARGE_M, CHARGE_T, CHARGE_F, MAX_STATE
	update_inputs();
	Event return_event = NOTHING;
	switch (current_s) {
	case START:
		if (v_bat >= VBAT_OK_VOLTAGE) {
			return_event = VBAT_OK;
		} else if ((v_sol >= VSOL_OK_VOLTAGE) && (i_sol >= ISOL_OK_CURRENT)) {
			return_event = VSOL_OK;
		}
		break;
	case IDLE:
		if (v_bat < VBAT_LOW_VOLTAGE) {
			return_event = VBAT_LOW;
		} else if ((v_sol >= VSOL_OK_VOLTAGE) && (i_sol >= ISOL_OK_CURRENT)) {
			return_event = VSOL_OK;
		}
		break;
	case CHARGE_M:
		if (v_bat >= VBAT_HIGH_VOLTAGE) {
			return_event = VBAT_HIGH;
		} else if ((v_sol < VSOL_OK_VOLTAGE) && (i_sol < ISOL_OK_CURRENT)) {
			return_event = VSOL_LOW;
		} else if (v_bat >= VBAT_OK_VOLTAGE) {
			return_event = VBAT_OK;
		} else if (v_bat < VBAT_LOW_VOLTAGE) {
			return_event = VBAT_LOW;
		}
		break;
	case CHARGE_T:
		if (i_bat < IBAT_LOW_CURRENT) {
			return_event = IBAT_LOW;
		} else if ((v_sol < VSOL_OK_VOLTAGE) && (i_sol < ISOL_OK_CURRENT)) {
			return_event = VSOL_LOW;
		} else if (v_bat < VBAT_LOW_VOLTAGE) {
			return_event = VBAT_LOW;
		}
		break;
	case CHARGE_F:
		if (v_bat < VBAT_LOW_VOLTAGE) {
			return_event = VBAT_LOW;
		} else if ((v_sol < VSOL_OK_VOLTAGE) && (i_sol < ISOL_OK_CURRENT)) {
			return_event = VSOL_LOW;
		}
		break;
	default:
		return_event = NOTHING; // maybe add a fault state
		break;
	}
	return return_event;
}
void pwm_on(void) {
	// Turn on PWM
	HAL_TIM_PWM_Start(&htim21, TIM_CHANNEL_1);
}
void pwm_off(void) {
	// Turn on PWM
	HAL_TIM_PWM_Stop(&htim21, TIM_CHANNEL_1);
	TIM21->CCR1 = 64;
}
void load_on(void) {
	// Turn load on GPIO PIN
	HAL_GPIO_WritePin(GPIOB, GPIO_LOAD_CTL_Pin, GPIO_PIN_SET);
	loadState = 1;
}
void load_off(void) {
	// Turn load off GPIO PIN
	HAL_GPIO_WritePin(GPIOB, GPIO_LOAD_CTL_Pin, GPIO_PIN_RESET);
	loadState = 0;
}
void do_nothing(void) {
	printf("do_nothing\n");
}
void charge_t(void) {
	float error;
	float step;
	char status;
	update_inputs();
	error = VOLTAGE_TOPPING - v_bat;
	step = abs(round(error));
	if (step > 64) {
		step = 64;
	}
	if (error > 0) {
		status = PWM_DC_Step(1, step);
	} else if (error < 0) {
		status = PWM_DC_Step(0, step);
	}
}
void charge_f(void) {
	float error;
	float step;
	char status;
	update_inputs();
	error = VOLTAGE_FLOAT - v_bat;
	step = abs(round(error));
	if (step > 64) {
		step = 64;
	}
	if (error > 0) {
		status = PWM_DC_Step(1, step);
	} else if (error < 0) {
		status = PWM_DC_Step(0, step);
	}
}
void update_inputs(void) {
	uint8_t sample_factor = 7;
	uint16_t NSAMPLES = 1 << sample_factor;
	uint32_t sum0 = 0;
	uint32_t sum1 = 0;
	uint32_t sum2 = 0;
	uint32_t sum3 = 0;
	uint32_t sum4 = 0;
	HAL_ADC_Start_DMA(&hadc, aResultDMA, 5);
	for (uint16_t i = 0; i < NSAMPLES; i++) {
		adc_conv_complt_flag = 1;
		while (adc_conv_complt_flag) {
		}; // wait for ADC conversion to complete
		sum0 += aResultDMA[0];
		sum1 += aResultDMA[1];
		sum2 += aResultDMA[2];
		sum3 += aResultDMA[3];
		sum4 += aResultDMA[4];
	}
	HAL_ADC_Stop_DMA(&hadc);
	// update inputs from ADC values
	v_sol = (sum0 >> sample_factor);
	i_sol = (sum1 >> sample_factor);
	v_bat = (sum2 >> sample_factor);
	i_bat = (sum3 >> sample_factor);
	i_load = (sum4 >> sample_factor);
}

static void logger(State current_state, Event current_event){
	memset(aTxBuffer,0,strlen(aTxBuffer));
	sprintf(aTxBuffer, "%s,%s,%lu,%u,%u,%u,%u,%u\n", state_names[current_state], event_names[current_event], TIM21->CCR1, v_sol, i_sol, v_bat, i_bat, i_load);
	HAL_UART_Transmit_DMA(&huart1, (uint8_t*)aTxBuffer, strlen(aTxBuffer));
}
static void test_solar(void){
	pwm_on();
	HAL_Delay(50);
	update_inputs();
	pwm_off();
}
void USARTx_IRQHandler(void) {
	HAL_UART_IRQHandler(&huart1);
	return;
}

void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef *hadc) {
	adc_conv_complt_flag = 0;
	return;
}
/* USER CODE END 4 */

/**
 * @brief  This function is executed in case of error occurrence.
 * @retval None
 */
void Error_Handler(void) {
	/* USER CODE BEGIN Error_Handler_Debug */
	/* User can add his own implementation to report the HAL error return state */
	__disable_irq();
	while (1) {
	}
	/* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
